{"sections":{"main":{"type":"main-page","disabled":true,"settings":{"show_title":false,"heading_bg":"rgba(0,0,0,0)","heading_color":"#407ec9","heading_text_alignment":"center","padding_top":28,"padding_bottom":12}},"13c6c2dc-ebc8-4ace-95a3-aa4cf15bf996":{"type":"collapsible-content","blocks":{"template--16968518107385__13c6c2dc-ebc8-4ace-95a3-aa4cf15bf996-collapsible_row-1":{"type":"collapsible_row","settings":{"heading":"Do I need to set up an account to place an order?","icon":"none","row_content":"<p>Creating an account on entertainer.pk is not obligatory. You can use a guest account to checkout without registering. However, an account on our website gives you access to the following benefits:<\/p><ul><li>Manage your account details, track your order status and review past purchases<\/li><li>Save your shipping details for future purchases and a faster shopping experience<\/li><li>Keep track of your past purchases<\/li><li>Be informed about our latest stock, special online promotions and discounts!<\/li><\/ul>","page":""}},"template--16968518107385__13c6c2dc-ebc8-4ace-95a3-aa4cf15bf996-collapsible_row-2":{"type":"collapsible_row","settings":{"heading":"How do I place an order?","icon":"none","row_content":"<p>Orders can be placed as a registered user or even as a guest. On any product page, select your color\/size choices (if applicable), choose quantity and then press the “Add to Cart” button. This will open up your shopping cart where you may choose to continue shopping, or head on to checkout. On the checkout page, you may add or confirm your personal and shipping information, select payment options, enter any discount vouchers (if applicable) and review your order before selecting “Place order now”.<\/p>","page":""}},"template--16968518107385__13c6c2dc-ebc8-4ace-95a3-aa4cf15bf996-collapsible_row-3":{"type":"collapsible_row","settings":{"heading":"How do I know if entertainer.pk has received my order?","icon":"none","row_content":"<p>After you place your order on the website, you will receive an email from entertainer.pk to confirm that your order has been placed. This will not, however, indicate that the order has been shipped. That information may be confirmed under “My Orders” in your account dashboard. If you’re not a Preferred Customer, then you may email our Customer Care at<a href=\"mailto:help@entertainer.pk\">help@theentertainer.pk<\/a>with your Order ID for your required information.<\/p>","page":""}},"template--16968518107385__13c6c2dc-ebc8-4ace-95a3-aa4cf15bf996-collapsible_row-4":{"type":"collapsible_row","settings":{"heading":"How can I track my order?","icon":"none","row_content":"<p>As soon as your order is placed, you will be emailed an Order ID, along with your Order Confirmation. This is what will help you track your order(s). You can also check this ID when you sign in to the Entertainer website. If you’re not a preferred customer, you may call or email our Customer Care with the tracking number information to find out the status of your order.<\/p>","page":""}},"131e01dc-8b44-4eb6-b6ce-9b8eeec13086":{"type":"collapsible_row","settings":{"heading":"What kind of payment methods do you accept?","icon":"none","row_content":"<p>Currently, the following payment methods are accepted:<\/p><p><strong>Cash on Delivery<\/strong><br\/>This option is available for customers throughout Pakistan. Using this option, you can pay cash to the delivery agent upon receipt of your order. Please ensure that you have the exact amount at hand since our delivery agents do not carry change\/petty cash.<\/p><p><strong>Credit\/Debit Card<\/strong><br\/>You can make a payment via credit\/debit card by selecting “Credit Card Payment” payment method. Any person who has a VISA or MasterCard can make a payment via this method. You will be redirected to a secure page to enter your card details. Once the payment is accepted, if required, you will receive a verification call. Please note that your card information is safe and your customer information is handled with the highest degree of confidentiality. Our website is secure with the Comodo SSL certificate. Our customer service agent will confirm your card details against the system. If we cannot get in touch with you within three days, we will cancel your transaction and order. Once your payment is processed, you will receive an order confirmation via email.<\/p>","page":""}},"49da0688-b6f9-47f3-8ec6-1609413c708e":{"type":"collapsible_row","settings":{"heading":"How long will it take for my order to be delivered?","icon":"none","row_content":"<p>All orders will be delivered by our courier service providers within 3-5 working days in Pakistan. If your order has not been delivered in the specified time, please contact our Customer Care.<\/p>","page":""}},"97206864-41f0-4d47-8b51-d13ad83fbe6c":{"type":"collapsible_row","settings":{"heading":"What if an incorrect\/damaged item is delivered to me?","icon":"none","row_content":"<p>We take complete care to ensure that each order reaches the correct recipient. However, in case such a mishap does occur, you can get in touch with our Customer Care for further help on the issue. You can email us at<a href=\"mailto:help@theentertainer.pk\">help@entertainer.pk <\/a>and relay your query.<\/p>","page":""}},"6f05702a-77ac-41bd-929d-a966e3af2b6b":{"type":"collapsible_row","settings":{"heading":"What if an incomplete order is delivered to me?","icon":"none","row_content":"<p>Full care is taken to ensure that only complete orders are shipped out. However, in case there is any missing item(s) in the order, please get in touch with our Customer Care immediately by emailing us at <a href=\"mailto:help@entertainer.pk\">help@theentertainer.pk<\/a><\/p>","page":""}},"d51b66e9-7623-4637-9a0c-921023879279":{"type":"collapsible_row","settings":{"heading":"What is the procedure for cancelling an order?","icon":"none","row_content":"<p>Order cancellation is dependent on whether or not it has been shipped. Generally, all orders are shipped after 24 hours, so send your order cancellation request to<a href=\"mailto:help@theentertainer.pk\">help@entertainer.pk<\/a>within that time. If the order has been shipped, you will be unable to cancel the request.<\/p>","page":""}},"45a6e7f1-088c-4992-a971-2ff8e66d749e":{"type":"collapsible_row","settings":{"heading":"I want to return my order, what do I do?","icon":"none","row_content":"<p>Unfortunately we do not issue refunds for returned products but we do offer online store credit which allows you to make a different purchase later on. For more details you can refer to our exchange\/return policy.<\/p>","page":""}},"6f2733b1-6b95-403a-8e60-f62c2337867b":{"type":"collapsible_row","settings":{"heading":"How Long Do I have to Exchange my Order?","icon":"none","row_content":"<p>You can exchange your order within the first 28 days of receiving the product. Please note that we do not offer refunds for products unless the product sent to you is faulty. For more details kindly refer to our exchange\/return policy.<\/p>","page":""}},"7408a519-91e1-4b64-b8ee-9a825b3c3fd4":{"type":"collapsible_row","settings":{"heading":"What is Online Store Credit?","icon":"none","row_content":"<p>It means you can return your purchase and utilize the same amount for a later purchase.<\/p>","page":""}},"b9d83de6-4615-4527-bfa5-ea04e9df4092":{"type":"collapsible_row","settings":{"heading":"I have a comment\/suggestion regarding your product\/service.","icon":"none","row_content":"<p>We highly value any and all feedback from our customers and fans! Please don’t hesitate in contacting our Customer Care with your comments and suggestions.<\/p>","page":""}}},"block_order":["template--16968518107385__13c6c2dc-ebc8-4ace-95a3-aa4cf15bf996-collapsible_row-1","template--16968518107385__13c6c2dc-ebc8-4ace-95a3-aa4cf15bf996-collapsible_row-2","template--16968518107385__13c6c2dc-ebc8-4ace-95a3-aa4cf15bf996-collapsible_row-3","template--16968518107385__13c6c2dc-ebc8-4ace-95a3-aa4cf15bf996-collapsible_row-4","131e01dc-8b44-4eb6-b6ce-9b8eeec13086","49da0688-b6f9-47f3-8ec6-1609413c708e","97206864-41f0-4d47-8b51-d13ad83fbe6c","6f05702a-77ac-41bd-929d-a966e3af2b6b","d51b66e9-7623-4637-9a0c-921023879279","45a6e7f1-088c-4992-a971-2ff8e66d749e","6f2733b1-6b95-403a-8e60-f62c2337867b","7408a519-91e1-4b64-b8ee-9a825b3c3fd4","b9d83de6-4615-4527-bfa5-ea04e9df4092"],"settings":{"caption":"","heading":"FAQ'S","heading_size":"h1","heading_alignment":"left","layout":"none","color_scheme":"","container_color_scheme":"","open_first_collapsible_row":false,"image_ratio":"adapt","desktop_layout":"image_second","padding_top":40,"padding_bottom":40}}},"order":["main","13c6c2dc-ebc8-4ace-95a3-aa4cf15bf996"]}