{"sections":{"main":{"type":"main-page","disabled":true,"settings":{"show_title":false,"heading_bg":"transparent","heading_color":"#407EC9","heading_text_alignment":"center","padding_top":28,"padding_bottom":12}},"af584234-0594-40aa-bd5d-25010a875350":{"type":"rich-text","blocks":{"25e95ae1-e0f6-4cc0-b54a-803f600da9aa":{"type":"heading","settings":{"heading":"Terms of Use \/ Privacy Policy","heading_size":"h0"}},"template--16980245184761__af584234-0594-40aa-bd5d-25010a875350-text-1":{"type":"text","settings":{"text":"<p>Share information about your brand with your customers. Describe a product, make announcements, or welcome customers to your store.<\/p>"}},"fc9a9adb-1cab-47c1-b38b-46b0be37c136":{"type":"html","settings":{"text":"","html":"<div class=\"container-fluid\">\n<div class=\"main-container col1-layout\">\n<div class=\"main\">\n<div class=\"col-main\">\n<div id=\"amfpc-global_messages\"><\/div> <div class=\"std\">\n<div id=\"amfpc-messages\"><\/div>\n<div class=\"policies privacy-policy\">\n<div class=\"content levels\">\n<div class=\"page-title\">\n<\/div>\n<p>The Entertainer takes the privacy of its customers very seriously and will take all measures to protect your personal information.<\/p>\n<p>Whether you register with us or use the site anonymously, the information we collect centers around your name, address, contact number(s), email ID, payment preferences, credit\/debit card numbers, bank account details, etc. This information will only be used, at the minimum, for the following purposes:<\/p>\n<ul class=\"outclass\">\n<li>To fill, process and ship your orders<\/li>\n<li>Contacting you for customer service and support<\/li>\n<li>Informing you of promotional offers<\/li>\n<li>your browsing experience of the Super Squad website<\/li>\n<\/ul>\n<p>No information will be revealed to any third-party entities for any purposes and your information will solely be used by The Entertainer.<\/p>\n<p>Please note that we use cookies to keep track of the frequency of your visits to our website, the contents of your shopping cart, purchase history and to deliver specific content designed to give you a uniquely personalized shopping experience. Most browsers generally accept cookies automatically, and you may change this setting if you wish to. You will still be able to access most of our website’s functionality, including the ability to make purchases.<\/p>\n<p>Registered users (who are using cookie-enabled web browsers) will be automatically signed in when they visit our website. Please note that users will be prompted to sign in again after 14 days, when the cookie expires.<\/p>\n<p>By browsing our website, you agree to abide by all our policies, which may be subject to change any time.<\/p>\n<\/div>\n<\/div>\n<\/div> <\/div>\n<\/div>\n<\/div>\n<\/div>"}}},"block_order":["25e95ae1-e0f6-4cc0-b54a-803f600da9aa","template--16980245184761__af584234-0594-40aa-bd5d-25010a875350-text-1","fc9a9adb-1cab-47c1-b38b-46b0be37c136"],"settings":{"desktop_content_position":"center","content_alignment":"center","color_scheme":"","full_width":true,"padding_top":40,"padding_bottom":52}}},"order":["main","af584234-0594-40aa-bd5d-25010a875350"]}